def main():
    questions = [
        ("Ваші прізвище, ім'я, по батькові? ", "Ваше ім'я: "),
        ("Скільки Вам років? ", "Ваш вік: "),
        ("Де Ви живете? ", "Ви живете в: "),
        ("Де Ви навчаєтесь? ", "Ви навчаєтесь в: "),
        ("Номер Вашої групи? ", "Номер моєї групи: "),
        ("Який Ваш порядковий номер у списку групи? ", "Мій порядковий номер у списку групи: "),
        ("Як ваші справи?", "У вас справи: "),
        ("Як Ви себе почуваєте?  ", "Ви себе почуваєте: "),
        ("Коли будете вдома?  ", "Ви будете вдома: "),
        ("Яку оцінку отримав на ЗНО по українській мові? ", "Ваша оцінка по ЗНО з укр.м. : "),
        ("Сьогодні сонячно? ", "Сьогодні сонячно (Так або Ні): "),
        ("Коли нарешті карантин?", "Карантин через: "),
        ("Як звати Вашого друга? ", "Його звати: "),
        ("Ви думаєте вступати у магістратуру?", "Ви думаєте вступати у магістратуру? "),
        ("Якого кольору Ваш зошит?", "Зошит : "),
        ("Який Ваш настрій сьогодні?", "Ваш настрій сьогодні : ")
    ]

    answers = []

    for question, _ in questions:
        answer = input(question)
        answers.append(answer)

    print("\nВаші дані:")
    for (_, output), answer in zip(questions, answers):
        print(output, answer)

if __name__ == "__main__":
    main()
